<a href="https://colab.research.google.com/github/RiteshopShrivastava/Pandas/blob/main/Pandas_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

In [36]:
df = pd.read_csv("/content/Salaries.csv")
print(df)

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [11]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [13]:
len(df.columns)

6

In [14]:
df.shape # no of records

(78, 6)

In [17]:
df.shape[0] # no of rows

78

In [15]:
list(df) # names of columns

['rank', 'discipline', 'phd', 'service', 'sex', 'salary']

In [18]:
df.columns # names of columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [16]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

Method

In [19]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [20]:
df.sample(10)

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
51       Prof          B   20       14  Female  127512
2        Prof          A   23       20    Male  110515
48       Prof          B   17       17  Female  111512
77       Prof          A   23       15  Female  109646
58       Prof          B   36       26  Female  144651
34  AssocProf          B   12        8    Male  119800
47  AssocProf          B   11       11  Female  103613
60   AsstProf          B    3        3  Female   92000
24       Prof          A   30       23    Male   91100

In [ ]:
dir(df) # list of methods that can be applied

In [23]:
df.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [25]:
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [26]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [ ]:
df.describe()
df.std()
df.head(50).mean()

In [30]:
df['phd']

0     56
1     12
2     23
3     40
4     20
      ..
73    18
74    19
75    17
76    28
77    23
Name: phd, Length: 78, dtype: int64

In [31]:
df['phd'].mean()

19.705128205128204

In [32]:
df['phd'].median()

18.5

In [33]:
df['phd'].mode()

0    4
dtype: int64

In [37]:
df['phd'].count()

78

In [38]:
df['phd'].describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [39]:
df_rank=df.groupby(['rank'])
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [40]:
df.groupby('rank')[['salary']].mean()

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123624.804348

In [ ]:
df['salary']>120000

In [ ]:
df[df['salary']>120000]

In [48]:
df1=df['phd']>=20

In [49]:
df1

0      True
1     False
2      True
3      True
4      True
      ...
73    False
74    False
75    False
76     True
77     True
Name: phd, Length: 78, dtype: bool

In [60]:
df['discipline']=='A'
#df['discipline']=="A"

0     False
1      True
2      True
3      True
4     False
      ...
73    False
74    False
75    False
76     True
77     True
Name: discipline, Length: 78, dtype: bool

In [ ]:
df[(df['phd']>=20) & (df['discipline']=="A")]

In [ ]:
df.iloc[:,0:3]

In [64]:
df_fifty=df.head(50)

In [ ]:
df.iloc[0:50,[2,3,5]]

In [ ]:
df_fifty.iloc[:,[2,3,5]]

In [ ]:
df.iloc[0:2,:]

In [ ]:
df.iloc[:,0:3]

In [72]:
df[['phd','salary']].agg(['min','max','mean'])

            phd         salary
min    1.000000   57800.000000
max   56.000000  186960.000000
mean  19.705128  108023.782051